Repository: AnTAVR/Python3_Qt6_template
Catalog: po/argparse.*.UTF-8.po
Languages: ru_ru

source: %(prog)s: error: %(message)s
ru_ru: %(prog)s: ошибка: %(message)s

source: %r is not callable
ru_ru: %r не вызываемый

source: 'required' is an invalid argument for positionals
ru_ru: 'требуется' недопустимый аргумент для позиций

source: .__call__() not defined
ru_ru: .__call__() не определен

source: ambiguous option: %(option)s could match %(matches)s
ru_ru: неоднозначный вариант: %(option)s может соответствовать %(matches)s

source: argument "-" with mode %r
ru_ru: аргумент "-" с режимом %r

source: can't open '%(filename)s': %(error)s
ru_ru: невозможно можете открыть '%(filename)s': %(error)s

source: cannot have multiple subparser arguments
ru_ru: не может иметь несколько аргументов subparser

source: cannot merge actions - two groups are named %r
ru_ru: не можете объединить действия - две группы названы %r

source: conflicting option string: %s
ru_ru: противоречивый вариант строки: %s

source: default: {}
ru_ru: по умолчанию: {}

source: dest= is required for options like %r
ru_ru: dest= требуется для опций, таких как %r

source: expected %s argument
ru_ru: ожидается %s аргумент

source: expected at least one argument
ru_ru: ожидается, по крайней мере один аргумент

source: expected at most one argument
ru_ru: ожидается не более одного аргумента

source: expected one argument
ru_ru: ожидается один аргумент

source: ignored explicit argument %r
ru_ru: игнорируется явный аргумент %r

source: invalid %(type)s value: %(value)r
ru_ru: недействительный %(type)s значение: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
ru_ru: неправильный выбор: %(value)r (выберите из %(choices)s)

source: invalid conflict_resolution value: %r
ru_ru: неправильное conflict_resolution значение: %r

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
ru_ru: неправильная опция строки %(option)r: должна начинаться с символа %(prefix_chars)r

source: mutually exclusive arguments must be optional
ru_ru: взаимоисключающие аргументы должны быть необязательными

source: not allowed with argument %s
ru_ru: невозможно разрешено с аргументом %s

source: one of the arguments %s is required
ru_ru: требуется один из аргументов %s

source: optional arguments
ru_ru: необязательные аргументы

source: positional arguments
ru_ru: позиционные аргументы

source: show this help message and exit
ru_ru: показать это сообщение и выйти.

source: the following arguments are required: %s
ru_ru: требуются следующие аргументы: %s

source: unexpected option string: %s
ru_ru: неожиданно вариант строка: %s

source: unknown parser %(parser_name)r (choices: %(choices)s)
ru_ru: неизвестный парсер %(parser_name)r (выбор: %(choices)s)

source: unrecognized arguments: %s
ru_ru: непризнанные аргументы: %s

source: usage:
ru_ru: использование:
